{
  "pages": [
    {
      "id": "homepage",
      "en": {
        "aboutMeTitle": "About Me",
        "aboutMeParagraph1": "A skilled and dedicated Backend Developer with solid experience in Java, TypeScript, JavaScript and Node.js. I focus on creating efficient and scalable backend systems, with an emphasis on seamless API integrations, performance optimization, and high-quality application delivery. I have a strong foundation in building reliable solutions that meet diverse project requirements.",
        "aboutMeParagraph2": "Additionally, I have hands-on experience with Docker, AWS Cloud, and Terraform, which I use to deploy and manage applications in cloud environments. These tools help me automate infrastructure tasks and manage cloud resources effectively, contributing to the stability and scalability of the systems I develop.",
        "aboutMeParagraph3": "I am always eager to learn and adapt to new technologies and industry practices, while placing a high value on teamwork and effective communication. I believe that strong collaboration plays a key role in achieving successful outcomes, and I strive to work closely with my colleagues to deliver practical and reliable backend solutions.",
        "skillsTitle": "Skills",
        "whatImDoingTitle": "What I'm Doing",
        "backendDevelopmentTitle": "Backend Development",
        "backendDevelopmentDesc": "Building robust, scalable, and secure backend systems using Java, Node.js, and modern frameworks. Focused on API design, microservices, and high-performance architectures for enterprise and cloud-native applications.",
        "webDevelopmentTitle": "Web Development",
        "webDevelopmentDesc": "Developing modern, responsive web applications with React, TypeScript, and best practices. Delivering seamless user experiences and integrating complex backend services.",
        "devOpsCloudTitle": "DevOps & Cloud Engineering",
        "devOpsCloudDesc": "Automating infrastructure and deployments using Docker, AWS, and Terraform. Implementing CI/CD pipelines, infrastructure as code, and cloud resource management for reliable and scalable systems.",
        "databaseEngineeringTitle": "Database Engineering",
        "databaseEngineeringDesc": "Designing, optimizing, and managing databases with PostgreSQL, MongoDB, Oracle, and MySQL. Ensuring data integrity, high availability, and performance for mission-critical applications."
      },
      "tr": {
        "aboutMeTitle": "Hakkımda",
        "aboutMeParagraph1": "Java, TypeScript, JavaScript ve Node.js konularında sağlam deneyime sahip yetenekli ve adanmış bir Backend Developer'ım. Verimli ve ölçeklenebilir arka uç sistemleri oluşturmaya odaklanıyorum, sorunsuz API entegrasyonları, performans optimizasyonu ve yüksek kaliteli uygulama teslimatına önem veriyorum. Çeşitli proje gereksinimlerini karşılayan güvenilir çözümler geliştirme konusunda güçlü bir temele sahibim.",
        "aboutMeParagraph2": "Ek olarak, Docker, AWS Cloud ve Terraform ile bulut ortamlarında uygulamaları dağıtma ve yönetme konusunda deneyimim var. Bu araçlar, altyapı görevlerini otomatikleştirmeme ve bulut kaynaklarını etkili bir şekilde yönetmeme yardımcı olarak geliştirdiğim sistemlerin istikrarına ve ölçeklenebilirliğine katkıda bulunuyor.",
        "aboutMeParagraph3": "Her zaman yeni teknolojileri ve endüstri pratiklerini öğrenmeye ve bunlara uyum sağlamaya hevesliyim, aynı zamanda ekip çalışmasına ve etkili iletişime büyük değer veriyorum. Güçlü işbirliğinin başarılı sonuçlar elde etmede kilit rol oynadığına inanıyorum ve pratik ve güvenilir arka uç çözümleri sunmak için meslektaşlarımla yakın çalışmaya gayret ediyorum.",
        "skillsTitle": "Yetenekler",
        "whatImDoingTitle": "Neler Yapıyorum",
        "backendDevelopmentTitle": "Backend Geliştirme",
        "backendDevelopmentDesc": "Java, Node.js ve modern framework'ler kullanarak sağlam, ölçeklenebilir ve güvenli arka uç sistemleri inşa ediyorum. Kurumsal ve bulut tabanlı uygulamalar için API tasarımı, mikro hizmetler ve yüksek performanslı mimarilere odaklanıyorum.",
        "webDevelopmentTitle": "Web Geliştirme",
        "webDevelopmentDesc": "React, TypeScript ve en iyi uygulamalarla modern, duyarlı web uygulamaları geliştiriyorum. Sorunsuz kullanıcı deneyimleri sunuyor ve karmaşık arka uç hizmetlerini entegre ediyorum.",
        "devOpsCloudTitle": "DevOps ve Bulut Mühendisliği",
        "devOpsCloudDesc": "Docker, AWS ve Terraform kullanarak altyapıyı ve dağıtımları otomatikleştiriyorum. Güvenilir ve ölçeklenebilir sistemler için CI/CD ardışık düzenleri, kod olarak altyapı ve bulut kaynak yönetimi uyguluyorum.",
        "databaseEngineeringTitle": "Veritabanı Mühendisliği",
        "databaseEngineeringDesc": "PostgreSQL, MongoDB, Oracle ve MySQL ile veritabanlarını tasarlıyor, optimize ediyor ve yönetiyorum. Kritik uygulamalar için veri bütünlüğünü, yüksek kullanılabilirliği ve performansı sağlıyorum."
      }
    },
    {
      "id": "resumePage",
      "en": {
        "resumeTitle": "Resume",
        "experienceTitle": "Experience",
        "educationTitle": "Education",
        "downloadCVButton": "Download CV",
        "seniorBackendDevOpsEngineerTitle": "Senior Backend Developer & DevOps Engineer",
        "kaunaAIName": "Kauna.ai",
        "kaunaAIDates": "Sep, 2024 – Jun, 2025",
        "kaunaAILocation": "Remote",
        "kaunaAIDesc1": "Architected and built a modular, testable, high-performance Node.js API from scratch using NestJS and TypeScript.",
        "kaunaAIDesc2": "Implemented full end-to-end user authentication with AWS Cognito, including native sign-up, email confirmation, sign-in, password reset, and resend-confirmation flows.",
        "kaunaAIDesc3": "Integrated OAuth2+PKCE social logins (Google, Facebook) via Cognito's /authorize and /token endpoints, leveraging Redis (ElastiCache) for secure session storage.",
        "kaunaAIDesc4": "Mastered the aws-sdk and aws-cognito-sdk libraries to handle all authentication flows server-side; added refresh-token blacklisting and single-device session management for enhanced security.",
        "kaunaAIDesc5": "Modeled and managed user–product relationships in MongoDB within transactions; optimized performance with indexes and sharding strategies.",
        "kaunaAIDesc6": "Employed Terraform for Infrastructure as Code, provisioning AWS resources (EKS, ElastiCache, S3, CloudFront, Lambda, API Gateway, IAM, ECS/ECR, SQS, SNS, CodePipeline, etc.) in modular dev/prod environments.",
        "kaunaAIDesc7": "Developed CI/CD pipelines using GitHub Actions and AWS CodePipeline/CodeBuild, automating Docker builds and deployments to AWS EKS/ECS with seamless rollback capabilities.",
        "kaunaAIDesc8": "Enforced security and reliability best practices: JWT authorization, CSRF protection, CORS configuration, rate-limiting, input validation, centralized exception handling, and comprehensive logging/monitoring.",
        "kaunaAIDesc9": "Integrated intelligent styling suggestions via the OpenAI API; added affiliate functionality with Amazon PAAPI and virtual try-on services, applying performance optimizations throughout.",
        "kaunaAIDesc10": "Established a scalable, best-practice microservices architecture that minimizes redundancy and enables rapid feature expansion.",
        "backendDeveloperObssTitle": "Backend Developer",
        "obssTechnologyName": "OBSS Technology",
        "obssTechnologyDates": "Nov, 2019 – Present",
        "obssTechnologyLocation": "Istanbul, Turkey",
        "obssTechnologyDesc1": "Worked in applications developed with Java, Node.js, React, Golang.",
        "obssTechnologyDesc2": "Spent 1 year on the Dragon AI-powered service project, mastering and applying Java, Python, Go, React, JSP, and Node.js to build an in-house solution from scratch.",
        "obssTechnologyDesc3": "Served 4 years as a senior developer on TEB Retail Internet Banking, refining and delivering sprint tasks on schedule using Java, Struts, JSP, and JavaScript.",
        "obssTechnologyDesc4": "Managed version control across ClearCase, ClearQuest, Git, and TFS; led the migration to Git and implemented Azure-based code review workflows and CI/CD pipelines for production deployments.",
        "obssTechnologyDesc5": "Wrote and optimized PL/SQL routines in Oracle to ensure reliable, high-performance database APIs.",
        "obssTechnologyDesc6": "Designed and rolled out a unit testing framework: researched best practices, integrated SonarQube/SonarLint for code coverage and quality metrics aligned with SDLC standards.",
        "obssTechnologyDesc7": "Configured and supported AI coding assistants (GitHub Copilot, Claude, GPT) in IntelliJ IDEA and VSCode, accelerating issue diagnosis and development efficiency.",
        "obssTechnologyDesc8": "Coordinated with cross-functional core teams to ensure smooth integration and delivery of features across the platform.",
        "obssTechnologyDesc9": "Applied SOLID principles and clean code practices across all projects, ensuring maintainable, testable, and scalable backend systems aligned with enterprise-grade architecture standards.",
        "fullstackDeveloperVadiTitle": "Fullstack Developer",
        "vadiName": "Vadi Kurumsal Bilgi Sistemleri",
        "vadiDates": "Nov, 2018 – Nov, 2019",
        "vadiLocation": "Istanbul, Turkey",
        "vadiDesc1": "Architected and implemented a microservices-based backend using Java 8, Spring MVC, Spring Boot, Spring Cloud, Hibernate, MySQL, and Oracle to deliver modular, high-performance services.",
        "vadiDesc2": "Built responsive Single-Page Application components with React, creating dynamic, user-friendly interfaces across desktop and mobile browsers.",
        "vadiDesc3": "Specialized in React Native to implement mobile-first features, integrating native modules and optimizing app performance on iOS and Android.",
        "vadiDesc4": "Leveraged Spring Cloud for service discovery, centralized configuration, and fault tolerance within the microservices ecosystem.",
        "vadiDesc5": "Invested in continuous learning—completed courses on modern Java and front-end frameworks—to adopt best practices and emerging technologies.",
        "backendDeveloperInternTitle": "Backend Developer Intern",
        "etiyaName": "Etiya",
        "etiyaDates": "Jun, 2017 – Aug, 2017",
        "etiyaLocation": "Istanbul, Turkey",
        "etiyaDesc1": "Assisted in developing and maintaining Java applications, ensuring seamless functionality and user-friendly interfaces.",
        "etiyaDesc2": "Supported the implementation of visually appealing UI designs that aligned with client requirements and design principles.",
        "etiyaDesc3": "Collaborated with cross-functional teams, including back-end developers and designers, to deliver efficient, high-quality, and scalable solutions.",
        "etiyaDesc4": "Gained hands-on experience in debugging, troubleshooting, and refining app features to improve user experience.",
        "etiyaDesc5": "Built SOAP APIs while learning API standards and clean code architecture for maintainable backend development.",
        "duzceUniversityName": "Duzce University",
        "duzceUniversityDegree": "Bachelor of Computer Engineering",
        "duzceUniversityDates": "2014 – 2018",
        "nesrinUcakliogluName": "Nesrin Ucaklioglu Anatolian High School",
        "nesrinUcakliogluDegree": "High School",
        "nesrinUcakliogluDates": "2010 – 2014"
      },
      "tr": {
        "resumeTitle": "Özgeçmiş",
        "experienceTitle": "Deneyim",
        "educationTitle": "Eğitim",
        "downloadCVButton": "CV'yi İndir",
        "seniorBackendDevOpsEngineerTitle": "Kıdemli Backend Developer & DevOps Mühendisi",
        "kaunaAIName": "Kauna.ai",
        "kaunaAIDates": "Eyl, 2024 – Haz, 2025",
        "kaunaAILocation": "Uzaktan",
        "kaunaAIDesc1": "NestJS ve TypeScript kullanarak sıfırdan modüler, test edilebilir, yüksek performanslı bir Node.js API tasarladım ve geliştirdim.",
        "kaunaAIDesc2": "AWS Cognito ile baştan sona kullanıcı kimlik doğrulamasını (yerel kayıt, e-posta onayı, oturum açma, şifre sıfırlama ve onay yeniden gönderme akışları dahil) uyguladım.",
        "kaunaAIDesc3": "Cognito'nun /authorize ve /token uç noktaları aracılığıyla OAuth2+PKCE sosyal girişlerini (Google, Facebook) entegre ettim ve güvenli oturum depolama için Redis (ElastiCache) kullandım.",
        "kaunaAIDesc4": "aws-sdk ve aws-cognito-sdk kütüphanelerinde uzmanlaşarak tüm kimlik doğrulama akışlarını sunucu tarafında yönettim; gelişmiş güvenlik için yenileme belirteci kara listesi ve tek cihaz oturum yönetimi ekledim.",
        "kaunaAIDesc5": "MongoDB'de kullanıcı-ürün ilişkilerini modeller ve işlemler içinde yönettim; dizinler ve parçalama stratejileri ile performansı optimize ettim.",
        "kaunaAIDesc6": "Kod olarak altyapı için Terraform'u kullandım, AWS kaynaklarını (EKS, ElastiCache, S3, CloudFront, Lambda, API Gateway, IAM, ECS/ECR, SQS, SNS, CodePipeline vb.) modüler geliştirme/üretim ortamlarında sağladım.",
        "kaunaAIDesc7": "GitHub Actions ve AWS CodePipeline/CodeBuild kullanarak CI/CD ardışık düzenleri geliştirdim, Docker derlemelerini ve AWS EKS/ECS'ye dağıtımları sorunsuz geri alma yetenekleriyle otomatik hale getirdim.",
        "kaunaAIDesc8": "JWT yetkilendirme, CSRF koruması, CORS yapılandırması, hız sınırlama, giriş doğrulama, merkezi istisna işleme ve kapsamlı günlük kaydı/izleme gibi güvenlik ve güvenilirlik en iyi uygulamalarını uyguladım.",
        "kaunaAIDesc9": "OpenAI API aracılığıyla akıllı stil önerilerini entegre ettim; Amazon PAAPI ve sanal deneme hizmetleriyle ortaklık işlevselliği ekledim, baştan sona performans optimizasyonları uyguladım.",
        "kaunaAIDesc10": "Yedekliliği en aza indiren ve hızlı özellik genişletmeye olanak tanıyan ölçeklenebilir, en iyi uygulama mikro hizmet mimarisi oluşturdum.",
        "backendDeveloperObssTitle": "Backend Developer",
        "obssTechnologyName": "OBSS Teknoloji",
        "obssTechnologyDates": "Kas, 2019 – Halen",
        "obssTechnologyLocation": "İstanbul, Türkiye",
        "obssTechnologyDesc1": "Java, Node.js, React, Golang ile geliştirilen uygulamalarda çalıştım.",
        "obssTechnologyDesc2": "Dragon AI destekli servis projesinde 1 yıl geçirdim, sıfırdan şirket içi bir çözüm oluşturmak için Java, Python, Go, React, JSP ve Node.js'yi uyguladım ve uzmanlaştım.",
        "obssTechnologyDesc3": "TEB Bireysel İnternet Bankacılığı'nda 4 yıl kıdemli developer olarak görev yaptım, sprint görevlerini Java, Struts, JSP ve JavaScript kullanarak zamanında teslim ettim.",
        "obssTechnologyDesc4": "ClearCase, ClearQuest, Git ve TFS arasında versiyon kontrolünü yönettim; Git'e geçişi yönettim ve üretim dağıtımları için Azure tabanlı kod inceleme iş akışları ve CI/CD ardışık düzenleri uyguladım.",
        "obssTechnologyDesc5": "Güvenilir, yüksek performanslı veritabanı API'leri sağlamak için Oracle'da PL/SQL rutinleri yazdım ve optimize ettim.",
        "obssTechnologyDesc6": "Bir birim test çerçevesi tasarladım ve kullanıma sundum: en iyi uygulamaları araştırdım, SDLC standartlarıyla uyumlu kod kapsamı ve kalite metrikleri için SonarQube/SonarLint'i entegre ettim.",
        "obssTechnologyDesc7": "IntelliJ IDEA ve VSCode'da AI kodlama yardımcılarını (GitHub Copilot, Claude, GPT) yapılandırdım ve destekledim, sorun teşhisini ve geliştirme verimliliğini hızlandırdım.",
        "obssTechnologyDesc8": "Platform genelinde özelliklerin sorunsuz entegrasyonunu ve teslimatını sağlamak için çapraz fonksiyonlu çekirdek ekiplerle koordine ettim.",
        "obssTechnologyDesc9": "Kurumsal düzeyde mimari standartlarına uygun, sürdürülebilir, test edilebilir ve ölçeklenebilir arka uç sistemleri sağlamak için tüm projelerde SOLID prensiplerini ve temiz kod uygulamalarını uyguladım.",
        "fullstackDeveloperVadiTitle": "Fullstack Developer",
        "vadiName": "Vadi Kurumsal Bilgi Sistemleri",
        "vadiDates": "Kas, 2018 – Kas, 2019",
        "vadiLocation": "İstanbul, Türkiye",
        "vadiDesc1": "Modüler, yüksek performanslı hizmetler sunmak için Java 8, Spring MVC, Spring Boot, Spring Cloud, Hibernate, MySQL ve Oracle kullanarak mikro hizmet tabanlı bir arka uç tasarladım ve uyguladım.",
        "vadiDesc2": "React ile duyarlı Tek Sayfalı Uygulama bileşenleri oluşturdum, masaüstü ve mobil tarayıcılarda dinamik, kullanıcı dostu arayüzler geliştirdim.",
        "vadiDesc3": "Mobil öncelikli özellikler uygulamak, yerel modülleri entegre etmek ve iOS ve Android'de uygulama performansını optimize etmek için React Native'de uzmanlaştım.",
        "vadiDesc4": "Mikro hizmet ekosistemi içinde hizmet keşfi, merkezi yapılandırma ve hata toleransı için Spring Cloud'dan yararlandım.",
        "vadiDesc5": "En iyi uygulamaları ve gelişen teknolojileri benimsemek için modern Java ve ön uç çerçeveleri üzerine sürekli öğrenmeye yatırım yaptım.",
        "backendDeveloperInternTitle": "Backend Developer Stajyeri",
        "etiyaName": "Etiya",
        "etiyaDates": "Haz, 2017 – Ağu, 2017",
        "etiyaLocation": "İstanbul, Türkiye",
        "etiyaDesc1": "Java uygulamalarının geliştirilmesine ve bakımına destek oldum, sorunsuz işlevsellik ve kullanıcı dostu arayüzler sağladım.",
        "etiyaDesc2": "Müşteri gereksinimleri ve tasarım prensipleriyle uyumlu görsel olarak çekici UI tasarımlarının uygulanmasını destekledim.",
        "etiyaDesc3": "Verimli, yüksek kaliteli ve ölçeklenebilir çözümler sunmak için arka uç geliştiriciler ve tasarımcılar da dahil olmak üzere çapraz fonksiyonlu ekiplerle işbirliği yaptım.",
        "etiyaDesc4": "Kullanıcı deneyimini iyileştirmek için hata ayıklama, sorun giderme ve uygulama özelliklerini iyileştirme konusunda uygulamalı deneyim kazandım.",
        "etiyaDesc5": "Sürdürülebilir arka uç geliştirme için API standartlarını ve temiz kod mimarisini öğrenirken SOAP API'leri oluşturdum.",
        "duzceUniversityName": "Düzce Üniversitesi",
        "duzceUniversityDegree": "Bilgisayar Mühendisliği Lisansı",
        "duzceUniversityDates": "2014 – 2018",
        "nesrinUcakliogluName": "Nesrin Uçaklıoğlu Anadolu Lisesi",
        "nesrinUcakliogluDegree": "Lise",
        "nesrinUcakliogluDates": "2010 – 2014"
      }
    },
    {
      "id": "coursesPage",
      "en": {
        "learningJourneyTitle": "Learning Journey",
        "coursesCompleted": "Courses Completed",
        "categoriesMastered": "Categories Mastered",
        "hoursOfLearning": "Hours of Learning",
        "coursesLabel": "courses",
        "udemyPlatform": "Udemy",
        "certifiedStatus": "Certified",
        "learningPlatformsTitle": "Learning Platforms",
        "platformsLabel": "platforms",
        "webPlatform": "Web Platform",
        "frontendFocusStatus": "Frontend Focus",
        "freeCodeCampName": "FreeCodeCamp",
        "freeCodeCampDesc": "Comprehensive web development curriculum focusing on HTML, CSS, JavaScript, and modern frameworks. Completed multiple certifications including Responsive Web Design and JavaScript Algorithms.",
        "javaScriptInfoName": "JavaScript.info",
        "javaScriptInfoDesc": "Deep dive into modern JavaScript concepts from basics to advanced topics. Mastered ES6+, async/await, promises, and advanced DOM manipulation techniques.",
        "mdnWebDocsName": "MDN Web Docs",
        "mdnWebDocsDesc": "Mozilla Developer Network - The ultimate reference for web technologies. Used extensively for HTML semantics, CSS properties, and JavaScript APIs documentation."
      },
      "tr": {
        "learningJourneyTitle": "Öğrenim Yolculuğu",
        "coursesCompleted": "Tamamlanan Kurs",
        "categoriesMastered": "Kategoride Uzmanlaştı",
        "hoursOfLearning": "Saat Öğrenim",
        "coursesLabel": "kurs",
        "udemyPlatform": "Udemy",
        "certifiedStatus": "Sertifikalı",
        "learningPlatformsTitle": "Öğrenim Platformları",
        "platformsLabel": "platform",
        "webPlatform": "Web Platformu",
        "frontendFocusStatus": "Frontend Odaklı",
        "freeCodeCampName": "FreeCodeCamp",
        "freeCodeCampDesc": "HTML, CSS, JavaScript ve modern framework'lere odaklanan kapsamlı web geliştirme müfredatı. Duyarlı Web Tasarımı ve JavaScript Algoritmaları dahil olmak üzere çok sayıda sertifika tamamlandı.",
        "javaScriptInfoName": "JavaScript.info",
        "javaScriptInfoDesc": "Temelden ileri düzey konulara kadar modern JavaScript kavramlarına derinlemesine dalış. ES6+, async/await, promise'ler ve gelişmiş DOM manipülasyon tekniklerinde uzmanlaşıldı.",
        "mdnWebDocsName": "MDN Web Docs",
        "mdnWebDocsDesc": "Mozilla Geliştirici Ağı - Web teknolojileri için nihai referans. HTML semantiği, CSS özellikleri ve JavaScript API'leri dokümantasyonu için yoğun bir şekilde kullanıldı."
      }
    },
    {
      "id": "contactPage",
      "en": {
        "findMeHereTitle": "Find Me Here",
        "downloadCVButton": "Download CV"
      },
      "tr": {
        "findMeHereTitle": "Beni Burada Bul",
        "downloadCVButton": "CV'yi İndir"
      }
    }
  ],
  "navbar": {
    "en": {
      "about": "About",
      "resume": "Resume",
      "courses": "Courses / Certifications",
      "contact": "Contact",
      "backendDeveloper": "Backend Developer"
    },
    "tr": {
      "about": "Hakkımda",
      "resume": "Özgeçmiş",
      "courses": "Kurslar / Sertifikalar",
      "contact": "İletişim",
      "backendDeveloper": "Backend Developer"
    }
  }
} 